In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv("Titanic-Dataset.csv")

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
## null values ko mean sa replace kr diya
df['Age'].fillna(df['Age'].mean(), inplace=True)

C:\Users\A L I E N W A R E\AppData\Local\Temp\ipykernel_5628\1698716155.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

In [14]:
print(df['Age'])

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [15]:
## embarked kioun keh categorical feature hy toh iska mean ni la skta toh mode la liya jo most frequent value sa replace 
## kr raha hy
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

C:\Users\A L I E N W A R E\AppData\Local\Temp\ipykernel_5628\3744086084.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [16]:
## kioun keh cabin ma bohot ziyada null values tha aur cabin number itna usefull ni hy toh usko drop krdiya
df.drop('Cabin', axis=1, inplace=True)

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [18]:
len(df)

891

In [19]:
df.drop_duplicates(inplace=True)

In [20]:
len(df)
## no difference in lenght after removing duplicates matlab 0 duplicates

891

In [27]:
## age ko int krdiya from float because we want a fixed age 
df['Age'] = df['Age'].astype(int)

In [22]:
df.rename(columns={'Pclass': 'PassengerClass', 
                   'SibSp': 'SiblingsSpouses', 
                   'Parch': 'ParentsChildren'}, inplace=True)

In [23]:
# Apply ko use krka aik new column banaya if a person is above or equal 18 they are a adult
df['Adult'] = df['Age'].apply(lambda x: True if x >= 18 else False)

In [24]:
# Another example: Convert 'Sex' column to numeric (0 for male, 1 for female)
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [26]:
print("\n----- Final Dataset Summary -----")
print(f"Number of Rows: {df.shape[0]}")
print(f"Number of Columns: {df.shape[1]}")
print(f"Duplicate Rows Removed: 0")
print(f"Missing Values After Handling:\n{df.isnull().sum()}")

print("\n----- Final Dataset Sample -----")
print(df.head())

----- Final Dataset Summary -----
Number of Rows: 891
Number of Columns: 12
Duplicate Rows Removed: 0
Missing Values After Handling:
PassengerId        0
Survived           0
PassengerClass     0
Name               0
Sex                0
Age                0
SiblingsSpouses    0
ParentsChildren    0
Ticket             0
Fare               0
Embarked           0
Adult              0
dtype: int64

----- Final Dataset Sample -----
   PassengerId  Survived  PassengerClass  \
0            1         0               3
1            2         1               1
2            3         1               3
3            4         1               1
4            5         0               3

                                                Name  Sex   Age  \
0                            Braund, Mr. Owen Harris    0  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    1  38.0
2                             Heikkinen, Miss. Laina    1  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)    1  35.0
4                           Allen, Mr. William Henry    0  35.0

   SiblingsSpouses  ParentsChildren            Ticket     Fare Embarked  Adult
0                1                0         A/5 21171   7.2500        S   True
1                1                0          PC 17599  71.2833        C   True
2                0                0  STON/O2. 3101282   7.9250        S   True
3                1                0            113803  53.1000        S   True
4                0                0            373450   8.0500        S   True